Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: Failed to communicate with Poedit process.
en: Feilen tu kommyunikeit with Poedit proses.

source: Failed to configure SR-IOV parameters
en: 無法配置SR-IOV參數

source: Failed to create pager pipe: %s
en: 無法創建尋呼機管道： %s

source: Failed to decode PKCS#8 private key.
en: 無法將 PKCS#8 私密金鑰解碼。

source: Failed to decode certificate.
en: 解碼憑證失敗。

source: Failed to decrypt the private key.
en: 解密私密金鑰失敗。

source: Failed to decrypt the private key: %d.
en: 解密私密金鑰失敗：%d。

source: Failed to decrypt the private key: decrypted data too large.
en: 解密私密金鑰失敗：解密的資料太龐大。

source: Failed to decrypt the private key: unexpected padding length.
en: 解密私密金鑰失敗：無預期的填空長度。

source: Failed to duplicate pager pipe: %s
en: 無法複製尋呼機管道： %s

source: Failed to encrypt: %d.
en: 加密失敗：%d。

source: Failed to extract WordPress information.
en: Feilen tu iksträkt WordPress informeiçion.

source: Failed to extract WordPress metadata from file %s.
en: Feilen tu iksträkt WordPress metadeita from fayl %s.

source: Failed to finalize decryption of the private key: %d.
en: 結束私密金鑰的解密失敗：%d。

source: Failed to find expected PKCS#8 end tag '%s'.
en: 找不到預期的 PKCS#8 結束標籤「%s」。

source: Failed to find expected PKCS#8 start tag.
en: 找不到預期的 PKCS#8 起始標籤。

source: Failed to find interface index for %s (%s)
en: 無法找到的接口索引 %s （%s)

source: Failed to fork pager: %s
en: fork分頁器失敗： %s

source: Failed to initialize the crypto engine.
en: 初始化 crypto 引擎失敗。

source: Failed to initialize the crypto engine: %d.
en: 初始化 crypto 引擎失敗： %d。

source: Failed to initialize the decryption cipher slot.
en: 初始化解密用的加密器插槽失敗。

source: Failed to initialize the decryption context.
en: 初始化解密上下文失敗。

source: Failed to initialize the encryption cipher slot.
en: 初始化加密用的加密器插槽失敗。

source: Failed to initialize the encryption context.
en: 初始化加密本文失敗。

source: Failed to load extracted catalog.
en: Feilen tu loud iksträkten katalog.

source: Failed to merge gettext catalogs.
en: Feilen tu mörj gettext katalogs.

source: Failed to recognize certificate
en: 识别证书失败

source: Failed to register with the requested network
en: 無法向要求的網路登記

source: Failed to select the specified APN
en: 無法選擇指定的 APN

source: Failed to set IV for decryption.
en: 設定解密用的 IV 失敗。

source: Failed to set IV for encryption.
en: 設定加密用的 IV 失敗。

source: Failed to set symmetric key for decryption.
en: 設定解密用的對稱式金鑰失敗。

source: Failed to set symmetric key for encryption.
en: 設定加密用的對稱式金鑰失敗。

source: Failed to update translation memory: %s
en: Feilen tu ùpdeit transleiçion memori: %s

source: Fatal Error:
en: 嚴重錯誤：

source: File %s appears to be a binary file.
en: 檔案 %s 似乎是二進位檔案。

source: File %s has changed on disk
en: 在碟上的 %s 檔案已變更

source: File %s has changed on disk since it was opened
en: 在磁碟上的 %s 檔案在開啟之後已變更

source: File 1
en: 檔案 1

source: File 2
en: 檔案 2

source: File 3
en: 檔案 3

source: File Filters
en: 檔案過濾器

source: File Status
en: 檔案狀態

source: File comparison
en: 檔案比對

source: File filters are in use, so not all files have been scanned.
en: 檔案過濾器正在使用中，所以並非所有檔案都被掃描。

source: File status filters
en: 檔案狀態過濾器

source: File timestamp resolution
en: 檔案時間戳記精細度

source: File “%s” contains characters that can’t be encoded using encoding “%s”. Would you like to save as UTF-8?
en: 「%s」檔案包含無法以「%s」編碼的字元。 您是否要將其另存為 UTF-8？

source: File “%s” doesn’t exist.
en: Fayl «%s» not du iksist.

source: File:
en: Fayl:

source: Filename filters
en: 檔案名稱過濾器

source: Filename-based filters
en: 基於檔案名稱的過濾器

source: Files are identical
en: 檔案完全相同

source: Files are identical except for differing line endings: %s
en: 這些檔案只有斷列字元有分別： %s

source: Files differ in line endings only
en: 檔案只有斷列字元有分別

source: Files hidden by case insensitive comparison
en: 因不區分大小寫的比對而隱藏的檔案

source: Files with invalid encodings found
en: 發現檔案使用的編碼不正確

source: Filters
en: 過濾器

source: Find
en: Faind

source: Find Ne_xt
en: 尋找下一個(_X)

source: Find Next
en: Faind Nèist

source: Find Previous
en: Faind Priv

source: Find _Previous
en: 尋找上一個(_P)

source: Find and replace text
en: 尋找並取代文字

source: Find in comments
en: Faind in komments

source: Find in source texts
en: Faind in sōrs teksts

source: Find in translations
en: Faind in transleiçions

source: Find next
en: Faind nèist

source: Find previous
en: Faind priv

source: Find:
en: 尋找：

source: Find…
en: 尋找…

source: First argument of operator interface at %L must be INTENT(IN)
en: %L 處運算子介面的第一個參數必須是 INTENT(IN)

source: Fix Language
en: Fiks Leŋgueij

source: Fix language
en: Fiks leŋgueij

source: Fix the Header
en: Fiks Hēdā

source: Fix the header
en: Fiks hēdā

source: Flags indicating how to handle the "ca-cert-password" property.
en: 標誌指示如何處理“ca-cert-password”屬性。

source: Flags indicating how to handle the "client-cert-password" property.
en: 標誌指示如何處理“client-cert-password”屬性。

source: Flags indicating how to handle the "leap-password" property.
en: 標誌指示如何處理“leap-password”屬性。

source: Flags indicating how to handle the "mka-cak" property.
en: 標誌指示如何處理“mka-cak”屬性。

source: Flags indicating how to handle the "password" property.
en: 標誌指示如何處理“密碼”屬性。

source: Flags indicating how to handle the "password-raw" property.
en: 標誌指示如何處理“password-raw”屬性。

source: Flags indicating how to handle the "phase2-ca-cert-password" property.
en: 標誌指示如何處理“phase2-ca-cert-password”屬性。

source: Flags indicating how to handle the "phase2-client-cert-password" property.
en: 標誌指示如何處理“phase2-client-cert-password”屬性。

source: Flags indicating how to handle the "phase2-private-key-password" property.
en: 標誌指示如何處理“phase2-private-key-password”屬性。

source: Flags indicating how to handle the "pin" property.
en: 標誌指示如何處理“pin”屬性。

source: Flags indicating how to handle the "private-key-password" property.
en: 標誌指示如何處理“private-key-password”屬性。

source: Flags indicating how to handle the "psk" property.
en: 標誌指示如何處理“psk”屬性。

source: Flags indicating how to handle the "wep-key0", "wep-key1", "wep-key2", and "wep-key3" properties.
en: 標誌指示如何處理“wep-key0”，“wep-key1”，“wep-key2”和“wep-key3”屬性。

source: Flags indicating which mode of WPS is to be used if any. There's little point in changing the default setting as NetworkManager will automatically determine whether it's feasible to start WPS enrollment from the Access Point capabilities. WPS can be disabled by setting this property to a value of 1.
en: 標誌指示WPS的哪種模式（如果有的話）。更改默認設置沒什麼意義，因為NetworkManager將自動確定從接入點功能啟動WPS註冊是否可行。可以通過將此屬性設置為值1來禁用WPS。

source: Flatten directories
en: 將檔案合併顯示（不顯示資料夾）

source: Folder Comparisons
en: 資料夾比對

source: Folder comparison
en: 資料夾比對

source: Folder “%s”
en: Fouldèr «%s»

source: Folders have no differences
en: 資料夾沒有差異

source: Font
en: 字型

source: For bug reporting instructions, please see: %s.
en: 報告程式缺陷的步驟請參見： %s。

source: For incoming packets, a list of mappings from 802.1p priorities to Linux SKB priorities. The mapping is given in the format "from:to" where both "from" and "to" are unsigned integers, ie "7:3".
en: 對於傳入數據包，從802.1p優先級到Linux SKB優先級的映射列表。映射以“from：to”格式給出，其中“from”和“to”都是無符號整數，即“7：3”。

source: For intrinsics library: pass all parameters in registers
en: 為內建函式庫：所有參數在暫存器中傳遞

source: For outgoing packets, a list of mappings from Linux SKB priorities to 802.1p priorities. The mapping is given in the format "from:to" where both "from" and "to" are unsigned integers, ie "7:3".
en: 對於傳出數據包，從Linux SKB優先級到802.1p優先級的映射列表。映射以“from：to”格式給出，其中“from”和“to”都是無符號整數，即“7：3”。

source: Force functions to be aligned to a 4 byte boundary
en: 將函式強行對齊到 4 位元組邊界上

source: Force the underlying type for "wchar_t" to be "unsigned short"
en: 強制指定「wchar_t」的內在類型為「unsigned short」

source: Forces use of the new PEAP label during key derivation. Some RADIUS servers may require forcing the new PEAP label to interoperate with PEAPv1. Set to "1" to force use of the new PEAP label. See the wpa_supplicant documentation for more details.
en: 在密鑰派生期間強制使用新的PEAP標籤。某些RADIUS服務器可能需要強制新的PEAP標籤與PEAPv1進行互操作。設置為“1”以強制使用新的PEAP標籤。有關更多詳細信息，請參閱wpa_supplicant文檔。

source: Forces which PEAP version is used when PEAP is set as the EAP method in the "eap" property. When unset, the version reported by the server will be used. Sometimes when using older RADIUS servers, it is necessary to force the client to use a particular PEAP version. To do so, this property may be set to "0" or "1" to force that specific PEAP version.
en: 當PEAP在“eap”屬性中設置為EAP方法時，使用PEAP版本的強制。取消設置時，將使用服務器報告的版本。有時，在使用較舊的RADIUS服務器時，必須強制客戶端使用特定的PEAP版本。為此，可以將此屬性設置為“0”或“1”以強制該特定PEAP版本。

source: Format as Patch
en: 格式化為修正檔

source: Format as Patch…
en: 格式化為修正檔…

source: Fortran 2003: FLUSH statement at %C
en: Fortran 2003：%C 處的 FLUSH 敘述

source: Forward delay
en: 轉送延遲

source: Found %d Twig template file supported by Poedit Pro.
en: Fainded %d-gè Twig templeit fayl sùpporten by Poedit Pro.

source: Found %d Twig template files supported by Poedit Pro.
en: Fainded %d-gè Twig templeit fayls sùpporten by Poedit Pro.

source: Found neither WordPress theme nor plugin in the folder.
en: Faind neither WordPress dè đöme or plùgin in the fouldèr.

source: Free version (please upgrade!)
en: Liborol vorçion (plis ùpgreid)

source: Fullscreen
en: 全螢幕

source: Function result '%s' at %L cannot have an initializer
en: 函式結果「%s」在 %L 處不能有初始值設定

source: Function starts are aligned to this power of 2
en: 函式入口對齊在 2 的此次方上

source: GCC supports only %u nested scopes
en: GCC 只支援 %u 個巢狀的作用欄位

source: GCC vector returned by reference: non-standard ABI extension with no compatibility guarantee
en: GCC 回傳向量參照：非標準的 ABI 擴充，不保證相容性

source: GNU Fortran comes with NO WARRANTY, to the extent permitted by law. You may redistribute copies of GNU Fortran under the terms of the GNU General Public License. For more information about these matters, see the file named COPYING
en: GNU Fortran 在法律允許的範圍內沒有任何擔保。 您可以在遵循 GNU 通用公共許可證的前提下分發 GNU Fortran 的副本。 有關事宜的詳情請參考名為 COPYING 的檔案

source: GSM Modem's SIM PIN required
en: 需要 GSM 數據機的 SIM PIN

source: GSM Modem's SIM PUK required
en: 需要 GSM 數據機的 SIM PUK

source: GSM Modem's SIM card not inserted
en: GSM 數據機的 SIM 卡尚未插入

source: GSM Modem's SIM wrong
en: GSM 數據機的 SIM 錯誤

source: Gateway
en: 閘道器

source: Gateway certificate hash
en: 網關證書哈希

source: General
en: Jenerol

source: General settings
en: 常規設置

source: Generate 32-bit FPU-less SHmedia code
en: 產生 32 位元不帶 FPU 的 SHmedia 程式碼

source: Generate 32-bit SHmedia code
en: 產生 32 位元 SHmedia 程式碼

source: Generate 32-bit code
en: 產生 32 位元程式碼

source: Generate 32bit i386 code
en: 產生 32 位元 i386 程式碼

source: Generate 64-bit FPU-less SHmedia code
en: 產生 64 位元不帶 FPU 的 SHmedia 程式碼

source: Generate 64-bit SHmedia code
en: 產生 64 位元 SHmedia 程式碼

source: Generate 64-bit code
en: 產生 64 位元程式碼

source: Generate APCS conformant stack frames
en: 產生與 APCS 相容的堆疊框架

source: Generate C header of platform-specific features
en: 產生有平台相關特性的 C 標頭檔案

source: Generate FPU-less SHcompact code
en: 產生不帶 FPU 的 SHcompact 程式碼

source: Generate GFLOAT double precision code
en: 產生 GFLOAT 雙精度程式碼

source: Generate H8/300H code
en: 產生 H8/300H 程式碼

source: Generate H8S code
en: 產生 H8S 程式碼

source: Generate H8S/2600 code
en: 產生 H8S/2600 程式碼

source: Generate H8SX code
en: 產生 H8SX 程式碼

source: Generate ILP32 code
en: 產生 ILP32 程式碼

source: Generate LP64 code
en: 產生 LP64 程式碼

source: Generate PA1.0 code
en: 產生 PA1.0 程式碼

source: Generate PA1.1 code
en: 產生 PA1.1 程式碼

source: Generate PA2.0 code (requires binutils 2.10 or later)
en: 產生 PA2.0 程式碼(需要 binutils 2.10 或更新版本)

source: Generate SH1 code
en: 產生 SH1 程式碼

source: Generate SH2e code
en: 產生 SH2e 程式碼

source: Generate SH3 code
en: 產生 SH3 程式碼

source: Generate SH3e code
en: 產生 SH3e 程式碼

source: Generate SH4a FPU-less code
en: 產生不帶 FPU 的 SH4a 程式碼

source: Generate SH4a code
en: 產生 SH4a 程式碼

source: Generate SH4al-dsp code
en: 產生 SH4al-dsp 程式碼

source: Generate SHcompact code
en: 產生 SHcompact 程式碼

source: Generate a call to abort if a noreturn function returns
en: 當 noreturn 函式回傳時呼叫 abort

source: Generate a single exit point for each function
en: 為每個函式產生單一的離開點

source: Generate big endian code
en: 產生高位位元組在前的程式碼

source: Generate big-endian code
en: 產生高位位元組在前的程式碼

source: Generate checks for references to NULL
en: 檢查參照 NULL 的參照

source: Generate code for GNU as
en: 為 GNU as 產生程式碼

source: Generate code for GNU assembler (gas)
en: 為 GNU 組譯器(gas)產生程式碼

source: Generate code for GNU ld
en: 為 GNU ld 產生程式碼

source: Generate code for NeXT (Apple Mac OS X) runtime environment
en: 為 NeXT (蘋果 Mac OS X) 執行時環境產生程式碼

source: Generate code for UNIX assembler
en: 為 UNIX 組譯器產生程式碼

source: Generate code for a 5206e
en: 為 5206e 產生程式碼

source: Generate code for a 520X
en: 為 520X 產生程式碼

source: Generate code for a 528x
en: 為 528x 產生程式碼

source: Generate code for a 5307
en: 為 5307 產生程式碼

source: Generate code for a 5407
en: 為 5407 產生程式碼

source: Generate code for a 68020
en: 為 68020 產生程式碼

source: Generate code for a 68030
en: 為 68030 產生程式碼

source: Generate code for a 68040
en: 為 68040 產生程式碼

source: Generate code for a 68040, without any new instructions
en: 為 68040 產生程式碼，不使用新指令

source: Generate code for a 68060
en: 為 68060 產生程式碼

source: Generate code for a 68060, without any new instructions
en: 為 68060 產生程式碼，不使用新指令

source: Generate code for a 68302
en: 為 68302 產生程式碼

source: Generate code for a 68332
en: 為 68332 產生程式碼

source: Generate code for a 68851
en: 為 68851 產生程式碼

source: Generate code for a DLL
en: 產生動態連結程式庫的程式碼

source: Generate code for an 11/10
en: 為 11/10 產生程式碼

source: Generate code for an 11/40
en: 為 11/40 產生程式碼

source: Generate code for an 11/45
en: 為 11/45 產生附加程式碼

source: Generate code for functions even if they are fully inlined
en: 為完全內聯的函式產生程式碼

source: Generate code for given CPU
en: 為給定的 CPU 產生程式碼

source: Generate code for huge switch statements
en: 為巨型的 switch 敘述產生程式碼

source: Generate code for old exec BSS PLT
en: 為舊的可執行 BSS PLT 產生程式碼

source: Generate code for the Boehm GC
en: 為 Boehm 產生程式碼

source: Generate code for the M*Core M210
en: 為 M*Core M210 產生程式碼

source: Generate code for the M*Core M340
en: 為 M*Core M340 產生程式碼

source: Generate code in big endian mode
en: 產生高位位元組在前的程式碼

source: Generate code in little endian mode
en: 產生低位位元組在前的程式碼

source: Generate code suitable for executables (NOT shared libs)
en: 產生的程式碼適合於可執行檔案(而不是共享函式庫)

source: Generate code that conforms to the given ABI
en: 產生遵循給定 ABI 的程式碼

source: Generate code that uses 68881 floating-point instructions
en: 產生使用 68881 浮點指令的程式碼

source: Generate code to check bounds before indexing arrays
en: 產生檢查陣列存取是否越界的程式碼

source: Generate code to use a non-exec PLT and GOT
en: 產生的程式碼使用不可執行 PLT 和 GOT

source: Generate code without GP reg
en: 產生不使用 GP 暫存器的程式碼

source: Generate cpp defines for server IO
en: 為伺服器 IO 產生 cpp 定義

source: Generate cpp defines for workstation IO
en: 為工作站 IO 產生 cpp 定義

source: Generate debug information in STABS format
en: 產生 STABS 格式的除錯資訊

source: Generate debug information in VMS format
en: 產生 VMS 格式的除錯資訊

source: Generate debug information in XCOFF format
en: 產生 XCOFF 格式的除錯資訊

source: Generate debug information in default extended format
en: 產生預設擴充格式的除錯資訊

source: Generate debug information in default format
en: 產生預設格式的除錯資訊

source: Generate debug information in extended STABS format
en: 產生擴充 STABS 格式的除錯資訊

source: Generate default single-precision SH4a code
en: 產生預設的單精度 SH4a 程式碼

source: Generate divide results with reminder having the same sign as the divisor (not the dividend)
en: 產生的除法結果中餘數符號將與除數而不是被除數相同

source: Generate fast indirect calls
en: 產生快速間接呼叫

source: Generate floating-point multiply-add instructions
en: 產生浮點乘加指令

source: Generate inline floating point division, optimize for latency
en: 產生內聯浮點除法，為最小延遲最佳化

source: Generate inline floating point division, optimize for throughput
en: 產生內聯浮點除法，為最大吞吐量最佳化

source: Generate inline integer division, optimize for latency
en: 產生內聯的整數除法，為最小延遲最佳化

source: Generate inline integer division, optimize for throughput
en: 產生內聯的整數除法，為最大吞吐量最佳化

source: Generate inline square root, optimize for latency
en: 產生內聯的平方根，為最小延遲最佳化

source: Generate inline square root, optimize for throughput
en: 產生內聯的平方根，為最大吞吐量最佳化

source: Generate little endian code
en: 產生低位位元組在前的程式碼

source: Generate little-endian code
en: 產生低位位元組在前的程式碼

source: Generate make dependencies
en: 產生 make 依賴項

source: Generate normal-mode code
en: 產生普通模式的程式碼

source: Generate only single-precision SH4a code
en: 只產生單精度 SH4a 程式碼

source: Generate pc-relative code
en: 產生相對 pc 的程式碼

source: Generate phony targets for all headers
en: 為所有標頭產生假的目的

source: Generate position-independent code for executables if possible (large mode)
en: 為可執行檔案盡可能產生與位置無關的程式碼(大模式)

source: Generate position-independent code if possible (large mode)
en: 盡可能產生與位置無關的程式碼(大模式)

source: Generate position-independent code if possible (small mode)
en: 盡可能產生與位置無關的程式碼(小模式)

source: Generate prefetch instructions, if available, for arrays in loops
en: 如果可用，為循環中的陣列產生預取指令

source: Generate run time type descriptor information
en: 產生執行時類型描述資訊

source: Generate self-relocatable code
en: 產生自身重定位程式碼

source: Generate sin, cos, sqrt for FPU
en: 為 FPU 產生 sin、cos 和 sqrt 指令

source: Generate special Objective-C methods to initialize/destroy non-POD C++ ivars, if needed
en: 如果需要，產生特殊的 Objective-C 方法來初始化/解構非簡單舊資料 C++ 變數

source: Generic settings
en: 通用設置

source: Give branches their default cost
en: 為分支指定預設代價

source: Go to Bookmark %i
en: Goutu Būkmark %i

source: Go to _Line
en: 跳到列(_L)

source: Go to a specific line
en: 跳到特定列

source: Go to bookmark %i
en: Goutu būkmark %i

source: Go to next change
en: 跳到下一個變更

source: Go to next tab
en: 跳到下一個分頁

source: Go to previous change
en: 跳到上一個變更

source: Go to previous tab
en: 跳到上一個分頁

source: Go to the next change
en: 跳到下一個變更

source: Go to the next conflict
en: 跳到下一個衝突

source: Go to the previous change
en: 跳到上一個變更

source: Go to the previous conflict
en: 跳到上一個衝突

source: Group forward mask
en: 集團前進面具

source: Group forward mask [0]
en: 組前向掩碼[0]

source: HTML Files
en: HTML Fayls

source: HTTP proxy password
en: HTTP 代理的密碼

source: Hairpin mode
en: Hairpin 模式

source: Hex-encoded Interface Identifier
en: 十六進制編碼的接口標識符

source: Hi_de
en: 隱藏(_D)

source: Hide
en: 隱藏

source: Hide %s
en: 隱藏 %s

source: Hide Sidebar
en: Neimai Saidbār

source: Hide Status Bar
en: Haid Steitùs Bar

source: Hide selected
en: 隱藏所選內容

source: Hide this notification message
en: Neimai nigè noutifaikeiçion messeij

source: Highlight _current line
en: 標示目前的列(_C)

source: Highlight current line
en: 標示目前的列

source: Highlight syntax
en: 語法標示

source: Hostname
en: 主機名稱

source: Hostname to send to DHCP server
en: 要發送到DHCP服務器的主機名

source: Hotspot password: %s
en: 熱點密碼： %s

source: How many additional levels of encapsulation are permitted to be prepended to packets. This property applies only to IPv6 tunnels.
en: 允許在數據包之前添加多少額外的封裝級別。此屬性僅適用於IPv6隧道。

source: ICE: emit_insn used where emit_jump_insn needed:
en: ICE：需要 emit_jump_insn 時使用了 emit_insn used where：

source: ID
en: AD

source: ID of shared library to build
en: 將要建立的共享函式庫的 ID

source: IEEE 802.15.4 (WPAN) parent device or connection UUID
en: IEEE 802.15.4（WPAN）父設備或連接UUID

source: IEEE 802.15.4 Personal Area Network (PAN) identifier.
en: IEEE 802.15.4個人局域網（PAN）標識符。

source: INQUIRE statement not allowed in PURE procedure at %C
en: INQUIRE 敘述不允許出現在 %C 處的 PURE 程序中

source: INTENT (%s) conflicts with INTENT(%s) at %L
en: INTENT (%s) 與 INTENT(%s) 在 %L 衝突

source: IP Tunnel
en: IP隧道

source: IP configuration could not be reserved (no available address, timeout, etc.)
en: IP 配置無法預留（沒有可用的位址、逾時等等。）

source: IP configuration method. NMSettingIP4Config and NMSettingIP6Config both support "auto", "manual", and "link-local". See the subclass-specific documentation for other values. In general, for the "auto" method, properties such as "dns" and "routes" specify information that is added on to the information returned from automatic configuration. The "ignore-auto-routes" and "ignore-auto-dns" properties modify this behavior. For methods that imply no upstream network, such as "shared" or "link-local", these properties must be empty. For IPv4 method "shared", the IP subnet can be configured by adding one manual IPv4 address or otherwise 10.42.x.0/24 is chosen. Note that the shared method must be configured on the interface which shares the internet to a subnet, not on the uplink which is shared.
en: IP配置方法。 NMSettingIP4Config和NMSettingIP6Config都支持“auto”，“manual”和“link-local”。有關其他值，請參閱特定於子類的文檔。通常，對於“自動”方法，諸如“dns”和“routes”之類的屬性指定添加到自動配置返回的信息的信息。 “ignore-auto-routes”和“ignore-auto-dns”屬性會修改此行為。對於不暗示上游網絡的方法，例如“shared”或“link-local”，這些屬性必須為空。對於IPv4方法“共享”，可以通過添加一個手動IPv4地址來配置IP子網，或者選擇10.42.x.0 / 24。請注意，必須在與子網共享Internet的接口上配置共享方法，而不是在共享的上行鏈路上配置共享方法。

source: IP tunnel
en: IP隧道

source: IP tunnel connection %d
en: IP隧道連接 %d

source: IP-tunnel settings
en: IP隧道設置

source: IPv4 CONFIGURATION
en: IPv4 配置

source: IPv4 protocol
en: IPv4協議

source: IPv6 CONFIGURATION
en: IPv6 配置

source: IPv6 SLAAC address generation mode
en: IPv6 SLAAC地址生成模式

source: IPv6 protocol
en: IPv6協議

source: ISO C does not support %<++%> and %<--%> on complex types
en: ISO C 不支援對複數類型進行 %<++%> 或 %<--%> 作業

source: ISO C does not support %<~%> for complex conjugation
en: ISO C 不支援用 ~ 求共軛複數

source: ISO C does not support complex integer types
en: ISO C 不支援複整數

source: ISO C does not support plain %<complex%> meaning %<double complex%>
en: ISO C 不支援單獨用 %<complex%> 表示 %<double complex%>

source: ISO C forbids %<goto *expr;%>
en: ISO C++ 不允許 %<goto *expr;%>

source: ISO C forbids assignment between function pointer and %<void *%>
en: ISO C 不允許在函式指標和 %<void *%> 間賦值

source: ISO C forbids casting nonscalar to the same type
en: ISO C 不允許將非標量轉換為其自身類型

source: ISO C forbids casts to union type
en: ISO C 不允許轉換為聯合類型

source: ISO C forbids comparison of %<void *%> with function pointer
en: ISO C 不允許在 %<void *%> 和函式指標間比較

source: ISO C forbids conditional expr between %<void *%> and function pointer
en: ISO C 不允許在條件運算式中同時使用 %<void *%> 和函式指標

source: ISO C forbids conversion of function pointer to object pointer type
en: ISO C 不允許將一個函式指標轉換為一個物件指標

source: ISO C forbids conversion of object pointer to function pointer type
en: ISO C 不允許將一個物件指標轉換為一個函式指標

source: ISO C forbids empty initializer braces
en: ISO C 不允許用初始值設定中有空的大括號對

source: ISO C forbids forward parameter declarations
en: ISO C 不允許前向參數宣告

source: ISO C forbids forward references to %<enum%> types
en: ISO C 不允許 %<enum%> 類型的前向參照

source: ISO C forbids initialization between function pointer and %<void *%>
en: ISO C 不允許在函式指標和 %<void *%> 間初始化

source: ISO C forbids label declarations
en: ISO C 不允許標籤宣告

source: ISO C forbids member declarations with no members
en: ISO C 不允許不含成員的成員宣告

source: ISO C forbids omitting the middle term of a ?: expression
en: ISO C 不允許省略 ?: 運算式中的第二項

source: ISO C forbids passing argument %d of %qE between function pointer and %<void *%>
en: ISO C 不允許將引數 %d(屬於 %qE)在函式指標和 %<void *%> 間傳遞

source: ISO C forbids return between function pointer and %<void *%>
en: ISO C 不允許在函式指標和 %<void *%> 間回傳

source: ISO C forbids specifying range of elements to initialize
en: ISO C 不允許在初始化指定元素的範圍

source: ISO C forbids subscripting %<register%> array
en: ISO C 不允許按下標存取 %<register%> 陣列

source: ISO C prohibits argument conversion to union type
en: ISO C 不允許將引數轉換為聯合

source: ISO C requires a named argument before %<...%>
en: ISO C 要求在 %<...%> 前有一個具名參數

source: ISO C++ does not permit %<%T::%D%> to be defined as %<%T::%D%>
en: ISO C++ 不允許將 %<%T::%D%> 定義為 %<%T::%D%>

source: ISO C++ forbids casting between pointer-to-function and pointer-to-object
en: ISO C++ 不允許在函式指標和物件指標間進行轉換

source: ISO C++ forbids casting to an array type %qT
en: ISO C++ 不允許轉換為陣列類型 %qT

source: ISO C++ forbids comparison between pointer and integer
en: ISO C++ 不允許比較指標和整數的值

source: ISO C++ forbids compound-literals
en: ISO C++ 不允許複合字面值

source: ISO C++ forbids in-class initialization of non-const static member %qD
en: ISO C++ 不允許在類別內初始化非常數靜態成員 %qD
